In [1]:
import pandas as pd
import numpy as np

In [2]:
# создадим несколько списков и массивов Numpy с информацией о семи странах мира
country = np.array(['China', 'Vietnam', 'United Kingdom', 'Russia', 'Argentina', 'Bolivia', 'South Africa'])
capital = ['Beijing', 'Hanoi', 'London', 'Moscow', 'Buenos Aires', 'Sucre', 'Pretoria']
population = [1400, 97, 67, 144, 45, 12, 59] # млн. человек
area = [9.6, 0.3, 0.2, 17.1, 2.8, 1.1, 1.2] # млн. кв. км.
sea = [1] * 5 + [0, 1] # выход к морю (в этом списке его нет только у Боливии)
 
# кроме того создадим список кодов стран, которые станут индексом датафрейма
custom_index = ['CN', 'VN', 'GB', 'RU', 'AR', 'BO', 'ZA']
 
# создадим пустой словарь
countries_dict = {}
 
# превратим эти списки в значения словаря,
# одновременно снабдив необходимыми ключами
countries_dict['country'] = country
countries_dict['capital'] = capital
countries_dict['population'] = population
countries_dict['area'] = area
countries_dict['sea'] = sea
 
# создадим датафрейм
countries = pd.DataFrame(countries_dict, index = custom_index)
countries

           country       capital  population  area  sea
CN           China       Beijing        1400   9.6    1
VN         Vietnam         Hanoi          97   0.3    1
GB  United Kingdom        London          67   0.2    1
RU          Russia        Moscow         144  17.1    1
AR       Argentina  Buenos Aires          45   2.8    1
BO         Bolivia         Sucre          12   1.1    0
ZA    South Africa      Pretoria          59   1.2    1

### __Копирование DataFrame__

__Метод .copy()__

In [3]:
# Вначале создадим копию датафрейма с помощью простого присвоения этого объекта новой переменной.
countries_new = countries

In [4]:
# удалим строку с данными про Аргентину и выведем исходный DataFrame
countries_new.drop(labels = 'AR', axis = 0, inplace = True)
countries

           country   capital  population  area  sea
CN           China   Beijing        1400   9.6    1
VN         Vietnam     Hanoi          97   0.3    1
GB  United Kingdom    London          67   0.2    1
RU          Russia    Moscow         144  17.1    1
BO         Bolivia     Sucre          12   1.1    0
ZA    South Africa  Pretoria          59   1.2    1

__inplace__

In [5]:
df = pd.DataFrame([[1, 1, 1],
                   [2, 2, 2],
                   [3, 3, 3]],
                  columns = ['A', 'B', 'C'])

df

   A  B  C
0  1  1  1
1  2  2  2
2  3  3  3

In [6]:
# попробуем удалить столбец A
df.drop(labels = ['A'], axis = 1, inplace = False)

   B  C
0  1  1
1  2  2
2  3  3

In [7]:
# проверим сохранилось ли изменение 
df

   A  B  C
0  1  1  1
1  2  2  2
2  3  3  3

In [8]:
# если метод выдает None, изменение постоянно
# изменим параметр inplace на True 
df.drop(labels = ['A'], axis = 1, inplace = True)

In [9]:
df

   B  C
0  1  1
1  2  2
2  3  3

In [10]:
# нельзя использовать inplace = True, и записывать результат в переменную одновременно
df = df.drop(labels = ['B'], axis = 1, inplace = True)
print(df)

None

### __Столбцы DataFrame__

__Именнование столбцов при создании DataFrame__

In [11]:
# создадим список с названиями столбцов на кириллице
custom_columns = ['страна', 'столица', 'население', 'площадь', 'море']

arr = np.array([country, capital, population, area, sea]).T
arr

array([['China', 'Beijing', '1400', '9.6', '1'],
       ['Vietnam', 'Hanoi', '97', '0.3', '1'],
       ['United Kingdom', 'London', '67', '0.2', '1'],
       ['Russia', 'Moscow', '144', '17.1', '1'],
       ['Argentina', 'Buenos Aires', '45', '2.8', '1'],
       ['Bolivia', 'Sucre', '12', '1.1', '0'],
       ['South Africa', 'Pretoria', '59', '1.2', '1']], dtype='<U32')

In [12]:
# создадим датафрейм 
countries = pd.DataFrame(data = arr,
                         index = custom_index,
                         columns = custom_columns)

countries

            страна       столица население площадь море
CN           China       Beijing      1400     9.6    1
VN         Vietnam         Hanoi        97     0.3    1
GB  United Kingdom        London        67     0.2    1
RU          Russia        Moscow       144    17.1    1
AR       Argentina  Buenos Aires        45     2.8    1
BO         Bolivia         Sucre        12     1.1    0
ZA    South Africa      Pretoria        59     1.2    1

In [13]:
# вернем прежние названия столбцов
countries.columns = ['country', 'capital', 'population', 'area', 'sea']

In [14]:
countries

           country       capital population  area sea
CN           China       Beijing       1400   9.6   1
VN         Vietnam         Hanoi         97   0.3   1
GB  United Kingdom        London         67   0.2   1
RU          Russia        Moscow        144  17.1   1
AR       Argentina  Buenos Aires         45   2.8   1
BO         Bolivia         Sucre         12   1.1   0
ZA    South Africa      Pretoria         59   1.2   1

__Переименование столбцов__

In [15]:
# переименуем столбец capital на city 
countries.rename(columns = {'capital' : 'city'}, inplace = True)
countries

           country          city population  area sea
CN           China       Beijing       1400   9.6   1
VN         Vietnam         Hanoi         97   0.3   1
GB  United Kingdom        London         67   0.2   1
RU          Russia        Moscow        144  17.1   1
AR       Argentina  Buenos Aires         45   2.8   1
BO         Bolivia         Sucre         12   1.1   0
ZA    South Africa      Pretoria         59   1.2   1

__Тип данных в столбце__

In [16]:
countries.dtypes

country       object
city          object
population    object
area          object
sea           object
dtype: object

__Изменение типа данных__

In [17]:
countries = countries.astype({'area' : 'float', 'sea' : 'category', 'population' : 'int64'})

In [18]:
countries.dtypes

country         object
city            object
population       int64
area           float64
sea           category
dtype: object

__Тип данных category__

In [19]:
countries.sea

CN    1
VN    1
GB    1
RU    1
AR    1
BO    0
ZA    1
Name: sea, dtype: category
Categories (2, object): ['0', '1']

__Фильтр столбцов по типу данных__

In [20]:
# выберем только типы данных int и float 
countries.select_dtypes(include = ['int64', 'float64'])

    population  area
CN        1400   9.6
VN          97   0.3
GB          67   0.2
RU         144  17.1
AR          45   2.8
BO          12   1.1
ZA          59   1.2

In [21]:
# выберем все типы кроме object и category 
countries.select_dtypes(exclude = ['object', 'category'])

    population  area
CN        1400   9.6
VN          97   0.3
GB          67   0.2
RU         144  17.1
AR          45   2.8
BO          12   1.1
ZA          59   1.2

### __Добавление строк и столбцов__

__Добавление строк__

__Метод .append() + словарь__

In [22]:
# создадим словарь с данными Канады и добавим его в DataFrame
dict_ = {'country': 'Canada', 'city': 'Ottawa', 'population': 38, 'area': 10, 'sea': '1'}

# словарь можно добавлять только если ignore_index = True
countries = countries._append(dict_, ignore_index = True)
countries

          country          city  population  area sea
0           China       Beijing        1400   9.6   1
1         Vietnam         Hanoi          97   0.3   1
2  United Kingdom        London          67   0.2   1
3          Russia        Moscow         144  17.1   1
4       Argentina  Buenos Aires          45   2.8   1
5         Bolivia         Sucre          12   1.1   0
6    South Africa      Pretoria          59   1.2   1
7          Canada        Ottawa          38  10.0   1

__Метод .append() + Series__

In [23]:
# причем, если передать список из Series, можно добавить сразу несколько строк
list_of_series = [pd.Series(['Spain', 'Madrid', 47, 0.5, 1], index = countries.columns),
                  pd.Series(['Netherlands', 'Amsterdam', 17, 0.04, 1], index = countries.columns)]
 
# нам по-прежнему необходим параметр ignore_index = True
# countries._append(list_of_series, ignore_index = True)
countries = pd.concat([countries, pd.DataFrame(list_of_series)], ignore_index=True)

countries

          country          city  population   area sea
0           China       Beijing        1400   9.60   1
1         Vietnam         Hanoi          97   0.30   1
2  United Kingdom        London          67   0.20   1
3          Russia        Moscow         144  17.10   1
4       Argentina  Buenos Aires          45   2.80   1
5         Bolivia         Sucre          12   1.10   0
6    South Africa      Pretoria          59   1.20   1
7          Canada        Ottawa          38  10.00   1
8           Spain        Madrid          47   0.50   1
9     Netherlands     Amsterdam          17   0.04   1

__Метод .append() + другой DataFrame__

In [24]:
peru = pd.DataFrame({'country': 'Peru',
                     'city': 'Lima',
                     'population': [33],
                     'area': [1.3],
                     'sea': [1]})

peru

  country  city  population  area  sea
0    Peru  Lima          33   1.3    1

In [25]:
# перед добавлением выберем первую строку с помощью метода .iloc[]
countries._append(peru.iloc[0], ignore_index = True)

           country          city  population   area sea
0            China       Beijing        1400   9.60   1
1          Vietnam         Hanoi          97   0.30   1
2   United Kingdom        London          67   0.20   1
3           Russia        Moscow         144  17.10   1
4        Argentina  Buenos Aires          45   2.80   1
5          Bolivia         Sucre          12   1.10   0
6     South Africa      Pretoria          59   1.20   1
7           Canada        Ottawa          38  10.00   1
8            Spain        Madrid          47   0.50   1
9      Netherlands     Amsterdam          17   0.04   1
10            Peru          Lima          33   1.30   1

__Использование .iloc[]__

Если вновь вывести то увидим что данные о перу не сохранились

In [26]:
countries

          country          city  population   area sea
0           China       Beijing        1400   9.60   1
1         Vietnam         Hanoi          97   0.30   1
2  United Kingdom        London          67   0.20   1
3          Russia        Moscow         144  17.10   1
4       Argentina  Buenos Aires          45   2.80   1
5         Bolivia         Sucre          12   1.10   0
6    South Africa      Pretoria          59   1.20   1
7          Canada        Ottawa          38  10.00   1
8           Spain        Madrid          47   0.50   1
9     Netherlands     Amsterdam          17   0.04   1

In [27]:
# добавим данные об этих странах на постоянной основе с помощью метода 
# .iloc[] и посмотрим на результат
countries.iloc[9] = ['Peru', 'Lima', 33, 1.3, 1]

countries

          country          city  population  area sea
0           China       Beijing        1400   9.6   1
1         Vietnam         Hanoi          97   0.3   1
2  United Kingdom        London          67   0.2   1
3          Russia        Moscow         144  17.1   1
4       Argentina  Buenos Aires          45   2.8   1
5         Bolivia         Sucre          12   1.1   0
6    South Africa      Pretoria          59   1.2   1
7          Canada        Ottawa          38  10.0   1
8           Spain        Madrid          47   0.5   1
9            Peru          Lima          33   1.3   1

В версии Pandas 2.0.0, которая была опубликована 3 апреля 2023 года, метод .append() был удален, и применение нижнего подчеркивания, хотя и позволяет выполнить присоединение строк, не является удачным решением.

### __Добавление столбцов__

__Объявление нового столбца__

In [28]:
# добавим столбец с данными о плотности населения
countries['pop_density'] = [153, 49, 281, 9, 17, 94, 508, 26, 32, 43]
countries

          country          city  population  area sea  pop_density
0           China       Beijing        1400   9.6   1          153
1         Vietnam         Hanoi          97   0.3   1           49
2  United Kingdom        London          67   0.2   1          281
3          Russia        Moscow         144  17.1   1            9
4       Argentina  Buenos Aires          45   2.8   1           17
5         Bolivia         Sucre          12   1.1   0           94
6    South Africa      Pretoria          59   1.2   1          508
7          Canada        Ottawa          38  10.0   1           26
8           Spain        Madrid          47   0.5   1           32
9            Peru          Lima          33   1.3   1           43

__Метод .insert()__

In [29]:
# добавим еще один столбец
countries.insert(loc = 1, # это будет второй по счету столбец
                 column = 'code',
                 value = ['CN', 'VN', 'GB', 'RU', 'AR', 'BL', 'SA', 'CA', 'ES', 'PE'])

In [30]:
countries

          country code          city  population  area sea  pop_density
0           China   CN       Beijing        1400   9.6   1          153
1         Vietnam   VN         Hanoi          97   0.3   1           49
2  United Kingdom   GB        London          67   0.2   1          281
3          Russia   RU        Moscow         144  17.1   1            9
4       Argentina   AR  Buenos Aires          45   2.8   1           17
5         Bolivia   BL         Sucre          12   1.1   0           94
6    South Africa   SA      Pretoria          59   1.2   1          508
7          Canada   CA        Ottawa          38  10.0   1           26
8           Spain   ES        Madrid          47   0.5   1           32
9            Peru   PE          Lima          33   1.3   1           43

__Метод .assign()__

In [31]:
countries = countries.assign(area_miles = countries.area / 2.59).round(2)
countries

,country,code,city,population,area,sea,pop_density,area_miles
0,China,CN,Beijing,1400,9.6,1,153,3.71
1,Vietnam,VN,Hanoi,97,0.3,1,49,0.12
2,United Kingdom,GB,London,67,0.2,1,281,0.08
3,Russia,RU,Moscow,144,17.1,1,9,6.60
4,Argentina,AR,Buenos Aires,45,2.8,1,17,1.08
5,Bolivia,BL,Sucre,12,1.1,0,94,0.42
6,South Africa,SA,Pretoria,59,1.2,1,508,0.46
7,Canada,CA,Ottawa,38,10.0,1,26,3.86
8,Spain,ES,Madrid,47,0.5,1,32,0.19
9,Peru,PE,Lima,33,1.3,1,43,0.50

In [32]:
# удалим этот столбец, что бы рассмотреть другие методы
countries.drop(labels = 'area_miles', axis = 1, inplace = True)

Можно усложнить код и добиться такого же результата, применив методы .iterrows() и .iloc[].

In [33]:
# выведем индекс и содержание строк
for index, row in countries.iterrows():
    # запишем для каждой строки (штвуч) в новый столбец округленное значение в милях
    countries.loc[index, 'area_miles'] = np.round(row.area / 2.59, 2)

countries

,country,code,city,population,area,sea,pop_density,area_miles
0,China,CN,Beijing,1400,9.6,1,153,3.71
1,Vietnam,VN,Hanoi,97,0.3,1,49,0.12
2,United Kingdom,GB,London,67,0.2,1,281,0.08
3,Russia,RU,Moscow,144,17.1,1,9,6.60
4,Argentina,AR,Buenos Aires,45,2.8,1,17,1.08
5,Bolivia,BL,Sucre,12,1.1,0,94,0.42
6,South Africa,SA,Pretoria,59,1.2,1,508,0.46
7,Canada,CA,Ottawa,38,10.0,1,26,3.86
8,Spain,ES,Madrid,47,0.5,1,32,0.19
9,Peru,PE,Lima,33,1.3,1,43,0.50

In [34]:
# снова удалим этот столбец
countries.drop(labels = 'area_miles', axis = 1, inplace = True)

In [35]:
countries.head(3)

          country code     city  population  area sea  pop_density
0           China   CN  Beijing        1400   9.6   1          153
1         Vietnam   VN    Hanoi          97   0.3   1           49
2  United Kingdom   GB   London          67   0.2   1          281

In [36]:
# есть более просто способ добавления нового столбца
countries['area_miles'] = (countries.area /2.59).round(2)
countries

,country,code,city,population,area,sea,pop_density,area_miles
0,China,CN,Beijing,1400,9.6,1,153,3.71
1,Vietnam,VN,Hanoi,97,0.3,1,49,0.12
2,United Kingdom,GB,London,67,0.2,1,281,0.08
3,Russia,RU,Moscow,144,17.1,1,9,6.60
4,Argentina,AR,Buenos Aires,45,2.8,1,17,1.08
5,Bolivia,BL,Sucre,12,1.1,0,94,0.42
6,South Africa,SA,Pretoria,59,1.2,1,508,0.46
7,Canada,CA,Ottawa,38,10.0,1,26,3.86
8,Spain,ES,Madrid,47,0.5,1,32,0.19
9,Peru,PE,Lima,33,1.3,1,43,0.50

### __Удаление строк и столбцов__

__Удаление строк__

In [37]:
# удалим строки по индексу с помощью метода .drop()
countries.drop(labels = [0, 1], axis = 0)

,country,code,city,population,area,sea,pop_density,area_miles
2,United Kingdom,GB,London,67,0.2,1,281,0.08
3,Russia,RU,Moscow,144,17.1,1,9,6.60
4,Argentina,AR,Buenos Aires,45,2.8,1,17,1.08
5,Bolivia,BL,Sucre,12,1.1,0,94,0.42
6,South Africa,SA,Pretoria,59,1.2,1,508,0.46
7,Canada,CA,Ottawa,38,10.0,1,26,3.86
8,Spain,ES,Madrid,47,0.5,1,32,0.19
9,Peru,PE,Lima,33,1.3,1,43,0.50

In [38]:
# удалим строки с индексом 5 и 7
countries.drop(index = [5, 7])

,country,code,city,population,area,sea,pop_density,area_miles
0,China,CN,Beijing,1400,9.6,1,153,3.71
1,Vietnam,VN,Hanoi,97,0.3,1,49,0.12
2,United Kingdom,GB,London,67,0.2,1,281,0.08
3,Russia,RU,Moscow,144,17.1,1,9,6.60
4,Argentina,AR,Buenos Aires,45,2.8,1,17,1.08
6,South Africa,SA,Pretoria,59,1.2,1,508,0.46
8,Spain,ES,Madrid,47,0.5,1,32,0.19
9,Peru,PE,Lima,33,1.3,1,43,0.50

In [39]:
# мы так же можем в параметр index передать индекс датафрейма через атрибут index
countries.drop(index = countries.index[4])

,country,code,city,population,area,sea,pop_density,area_miles
0,China,CN,Beijing,1400,9.6,1,153,3.71
1,Vietnam,VN,Hanoi,97,0.3,1,49,0.12
2,United Kingdom,GB,London,67,0.2,1,281,0.08
3,Russia,RU,Moscow,144,17.1,1,9,6.60
5,Bolivia,BL,Sucre,12,1.1,0,94,0.42
6,South Africa,SA,Pretoria,59,1.2,1,508,0.46
7,Canada,CA,Ottawa,38,10.0,1,26,3.86
8,Spain,ES,Madrid,47,0.5,1,32,0.19
9,Peru,PE,Lima,33,1.3,1,43,0.50

In [40]:
# с атрибутом датафрейма index мы можем делать срезы
# удалим каждую вторую строку, начиная с четвертой с конца
countries.drop(index = countries.index[-4::2])

,country,code,city,population,area,sea,pop_density,area_miles
0,China,CN,Beijing,1400,9.6,1,153,3.71
1,Vietnam,VN,Hanoi,97,0.3,1,49,0.12
2,United Kingdom,GB,London,67,0.2,1,281,0.08
3,Russia,RU,Moscow,144,17.1,1,9,6.60
4,Argentina,AR,Buenos Aires,45,2.8,1,17,1.08
5,Bolivia,BL,Sucre,12,1.1,0,94,0.42
7,Canada,CA,Ottawa,38,10.0,1,26,3.86
9,Peru,PE,Lima,33,1.3,1,43,0.50

__Удаление столбцов__

In [41]:
countries.drop(labels = ['area_miles', 'code'], axis = 1)

          country          city  population  area sea  pop_density
0           China       Beijing        1400   9.6   1          153
1         Vietnam         Hanoi          97   0.3   1           49
2  United Kingdom        London          67   0.2   1          281
3          Russia        Moscow         144  17.1   1            9
4       Argentina  Buenos Aires          45   2.8   1           17
5         Bolivia         Sucre          12   1.1   0           94
6    South Africa      Pretoria          59   1.2   1          508
7          Canada        Ottawa          38  10.0   1           26
8           Spain        Madrid          47   0.5   1           32
9            Peru          Lima          33   1.3   1           43

In [42]:
# аналогичный результат можно получить передав список удаляемых столбцов в параметр columns
countries.drop(columns = ['area_miles', 'code'])

          country          city  population  area sea  pop_density
0           China       Beijing        1400   9.6   1          153
1         Vietnam         Hanoi          97   0.3   1           49
2  United Kingdom        London          67   0.2   1          281
3          Russia        Moscow         144  17.1   1            9
4       Argentina  Buenos Aires          45   2.8   1           17
5         Bolivia         Sucre          12   1.1   0           94
6    South Africa      Pretoria          59   1.2   1          508
7          Canada        Ottawa          38  10.0   1           26
8           Spain        Madrid          47   0.5   1           32
9            Peru          Lima          33   1.3   1           43

In [43]:
countries

,country,code,city,population,area,sea,pop_density,area_miles
0,China,CN,Beijing,1400,9.6,1,153,3.71
1,Vietnam,VN,Hanoi,97,0.3,1,49,0.12
2,United Kingdom,GB,London,67,0.2,1,281,0.08
3,Russia,RU,Moscow,144,17.1,1,9,6.60
4,Argentina,AR,Buenos Aires,45,2.8,1,17,1.08
5,Bolivia,BL,Sucre,12,1.1,0,94,0.42
6,South Africa,SA,Pretoria,59,1.2,1,508,0.46
7,Canada,CA,Ottawa,38,10.0,1,26,3.86
8,Spain,ES,Madrid,47,0.5,1,32,0.19
9,Peru,PE,Lima,33,1.3,1,43,0.50

In [44]:
# удалим последний столбец
countries.drop(columns = countries.columns[-1])

          country code          city  population  area sea  pop_density
0           China   CN       Beijing        1400   9.6   1          153
1         Vietnam   VN         Hanoi          97   0.3   1           49
2  United Kingdom   GB        London          67   0.2   1          281
3          Russia   RU        Moscow         144  17.1   1            9
4       Argentina   AR  Buenos Aires          45   2.8   1           17
5         Bolivia   BL         Sucre          12   1.1   0           94
6    South Africa   SA      Pretoria          59   1.2   1          508
7          Canada   CA        Ottawa          38  10.0   1           26
8           Spain   ES        Madrid          47   0.5   1           32
9            Peru   PE          Lima          33   1.3   1           43

In [45]:
# удалим пятую строку и несколько столбцов и сохраним изменения
countries.drop(index = 4, inplace = True)
countries.drop(columns = ['code', 'pop_density', 'area_miles'], inplace = True)
countries

          country      city  population  area sea
0           China   Beijing        1400   9.6   1
1         Vietnam     Hanoi          97   0.3   1
2  United Kingdom    London          67   0.2   1
3          Russia    Moscow         144  17.1   1
5         Bolivia     Sucre          12   1.1   0
6    South Africa  Pretoria          59   1.2   1
7          Canada    Ottawa          38  10.0   1
8           Spain    Madrid          47   0.5   1
9            Peru      Lima          33   1.3   1

__Удаление по многоуровневому индексу__

In [46]:
# создадим несколько списков и массивов Numpy с информацией о семи странах мира
country = np.array(['China', 'Vietnam', 'United Kingdom', 'Russia', 'Argentina', 'Bolivia', 'South Africa'])
capital = ['Beijing', 'Hanoi', 'London', 'Moscow', 'Buenos Aires', 'Sucre', 'Pretoria']
population = [1400, 97, 67, 144, 45, 12, 59] # млн. человек
area = [9.6, 0.3, 0.2, 17.1, 2.8, 1.1, 1.2] # млн. кв. км.
sea = [1] * 5 + [0, 1] # выход к морю (в этом списке его нет только у Боливии)
 
# кроме того создадим список кодов стран, которые станут индексом датафрейма
custom_index = ['CN', 'VN', 'GB', 'RU', 'AR', 'BO', 'ZA']
 
# создадим пустой словарь
countries_dict = {}
 
# превратим эти списки в значения словаря,
# одновременно снабдив необходимыми ключами
countries_dict['country'] = country
countries_dict['capital'] = capital
countries_dict['population'] = population
countries_dict['area'] = area
countries_dict['sea'] = sea
 
# создадим датафрейм
countries = pd.DataFrame(countries_dict, index = custom_index)

# подготовим данные для многоуровневого индекса строк
rows = [('Asia', 'CN'),
        ('Asia', 'VN'),
        ('Europe', 'GB'),
        ('Europe', 'RU'),
        ('Europe', 'ES'),
        ('Europe', 'NL'),
        ('S. America', 'PE')]
 
# и столбцов
cols = [('names', 'country'),
        ('names', 'city'),
        ('data', 'population'),
        ('data', 'area'),
        ('data', 'sea')]

# создадим многоуровневый (иерархический) индекс
# для индекса строк добавим названия столбцов индекса через параметр names
custom_multindex = pd.MultiIndex.from_tuples(rows, names = ['region', 'code'])
custom_multicols = pd.MultiIndex.from_tuples(cols)
 
# поместим индексы в атрибуты index и columns датафрейма
countries.index = custom_multindex
countries.columns = custom_multicols
 
# посмотрим на результат
countries

                          names                     data
                        country          city population  area sea
region     code
Asia       CN             China       Beijing       1400   9.6   1
           VN           Vietnam         Hanoi         97   0.3   1
Europe     GB    United Kingdom        London         67   0.2   1
           RU            Russia        Moscow        144  17.1   1
           ES         Argentina  Buenos Aires         45   2.8   1
           NL           Bolivia         Sucre         12   1.1   0
S. America PE      South Africa      Pretoria         59   1.2   1

__Удаление строк__

In [47]:
# удалим азиатский регион
# Воспользуемся методом .drop(), которому передадим параметр labels = 'Asia', укажем удаляем строки axis = 0,
# а так же укажем что Азия находится в индексе по названием region (level = 0)
countries.drop(labels = 'Asia', axis = 0, level = 0)

                          names                     data
                        country          city population  area sea
region     code
Europe     GB    United Kingdom        London         67   0.2   1
           RU            Russia        Moscow        144  17.1   1
           ES         Argentina  Buenos Aires         45   2.8   1
           NL           Bolivia         Sucre         12   1.1   0
S. America PE      South Africa      Pretoria         59   1.2   1

In [48]:
# удалим запись о России по ее индексу в столбце code (т.е. level = 1)
countries.drop(index = 'RU', level = 1)

                          names                     data
                        country          city population area sea
region     code
Asia       CN             China       Beijing       1400  9.6   1
           VN           Vietnam         Hanoi         97  0.3   1
Europe     GB    United Kingdom        London         67  0.2   1
           ES         Argentina  Buenos Aires         45  2.8   1
           NL           Bolivia         Sucre         12  1.1   0
S. America PE      South Africa      Pretoria         59  1.2   1

__Удаление столбцов__

In [49]:
 # Передадим методу .drop() параметры labels, level и axis = 1 для удаления столбца по его наименованию (labels) на нужном нам уровне (level) индекса.

In [50]:
# удалим все столбцы в разделе names на нулевом уровне индекса столбцов
countries.drop(labels = 'names', level = 0, axis = 1)

                      data
                population  area sea
region     code
Asia       CN         1400   9.6   1
           VN           97   0.3   1
Europe     GB           67   0.2   1
           RU          144  17.1   1
           ES           45   2.8   1
           NL           12   1.1   0
S. America PE           59   1.2   1

In [51]:
# удалим столбцы city и area на втором уровне индекса (level - 1)
countries.drop(columns = ['city', 'area'], level = 1)

                          names       data
                        country population sea
region     code
Asia       CN             China       1400   1
           VN           Vietnam         97   1
Europe     GB    United Kingdom         67   1
           RU            Russia        144   1
           ES         Argentina         45   1
           NL           Bolivia         12   0
S. America PE      South Africa         59   1

### __Применение функций__

In [52]:
people = pd.DataFrame({'name': ['Алексей', 'Иван', 'Анна', 'Ольга', 'Николай'],
                       'gender': [1, 1, 0, 2, 1],
                       'age': [35, 20, 13, 28, 16],
                       'height': [180.46, 182.26, 165.12, 168.04, 178.68],
                       'weight': [73.61, 75.34, 50.22, 52.14, 69.72],
                      })

people

      name  gender  age  height  weight
0  Алексей       1   35  180.46   73.61
1     Иван       1   20  182.26   75.34
2     Анна       0   13  165.12   50.22
3    Ольга       2   28  168.04   52.14
4  Николай       1   16  178.68   69.72

__Метод .map()__

In [53]:
# map это карта представляющая собой питоновский словарь, где ключи старые данные, а значения - новые
gender_map = {0: 'female', 1: 'male'}
people['gender'] = people['gender'].map(gender_map)

people

      name  gender  age  height  weight
0  Алексей    male   35  180.46   73.61
1     Иван    male   20  182.26   75.34
2     Анна  female   13  165.12   50.22
3    Ольга     NaN   28  168.04   52.14
4  Николай    male   16  178.68   69.72

В метод .map() мы можем передать и lambda-функцию.

In [54]:
# например, для того, чтобы выявить совершеннолетних и несовершеннолетних людей
people['age_group'] = people['age'].map(lambda x: 'adult' if x >= 18 else 'minor')
people

      name  gender  age  height  weight age_group
0  Алексей    male   35  180.46   73.61     adult
1     Иван    male   20  182.26   75.34     adult
2     Анна  female   13  165.12   50.22     minor
3    Ольга     NaN   28  168.04   52.14     adult
4  Николай    male   16  178.68   69.72     minor

In [55]:
# удалим только что созданный столбец age_group
people.drop(labels = 'age_group', axis = 1, inplace = True)
people

      name  gender  age  height  weight
0  Алексей    male   35  180.46   73.61
1     Иван    male   20  182.26   75.34
2     Анна  female   13  165.12   50.22
3    Ольга     NaN   28  168.04   52.14
4  Николай    male   16  178.68   69.72

In [56]:
# для более сложных преобразований можно использовать обычную функцию
def get_age_group(age):
    threshold = 18
    if age >= threshold:
        age_group = 'adult'
    else:
        age_group = 'minor'
    
    return age_group

In [57]:
people['age_group'] = people['age'].map(get_age_group)
people

      name  gender  age  height  weight age_group
0  Алексей    male   35  180.46   73.61     adult
1     Иван    male   20  182.26   75.34     adult
2     Анна  female   13  165.12   50.22     minor
3    Ольга     NaN   28  168.04   52.14     adult
4  Николай    male   16  178.68   69.72     minor

In [58]:
# удалим созданный столбец
people.drop(labels = 'age_group', axis = 1, inplace = True)
people

      name  gender  age  height  weight
0  Алексей    male   35  180.46   73.61
1     Иван    male   20  182.26   75.34
2     Анна  female   13  165.12   50.22
3    Ольга     NaN   28  168.04   52.14
4  Николай    male   16  178.68   69.72

__Функция np.where()__

In [59]:
# Такой же результат мы получим применив функцию np.where()
# внутри функции три параметра (1) условие, (2) значение если True, (3) значение если False
people['age_group'] = np.where(people['age'] >= 18, 'adult', 'minor')
people

      name  gender  age  height  weight age_group
0  Алексей    male   35  180.46   73.61     adult
1     Иван    male   20  182.26   75.34     adult
2     Анна  female   13  165.12   50.22     minor
3    Ольга     NaN   28  168.04   52.14     adult
4  Николай    male   16  178.68   69.72     minor

In [60]:
# удалим созданный столбец
people.drop(labels = 'age_group', axis = 1, inplace = True)

In [61]:
people

      name  gender  age  height  weight
0  Алексей    male   35  180.46   73.61
1     Иван    male   20  182.26   75.34
2     Анна  female   13  165.12   50.22
3    Ольга     NaN   28  168.04   52.14
4  Николай    male   16  178.68   69.72

__Метод .where()__

Метод .where() библиотеки Pandas действует немного иначе. В нем мы прописываем условие, которое хотим применить к отдельному столбцу или всему датафрейму.

Если условие выполняется (т.е. оценивается как True), мы сохраняем текущее значение датафрейма.
Если условие не выполняется (False), то значение заменяется на новое, указанное в методе .where().

In [62]:
# заменим возраст тех, кому меньше 18 на Nan 
people.age.where(people.age >= 18, other = np.nan)

0    35.0
1    20.0
2     NaN
3    28.0
4     NaN
Name: age, dtype: float64

In [63]:
# создадим матрицу из вложенных списков
nums_matrix = [[-13, 7, 1],
               [4, -2, 25],
               [45, -3, 8]]

nums = pd.DataFrame(nums_matrix)
nums

    0  1   2
0 -13  7   1
1   4 -2  25
2  45 -3   8

In [64]:
nums.where(nums > 0, other = -nums)

    0  1   2
0  13  7   1
1   4  2  25
2  45  3   8

__Метод .applay()__

В отличие от .map(), метод .apply() позволяет передавать именованные аргументы в применяемую функцию.

In [65]:
# Объявим функцию, которй можно передать не только значение возраста, но и порог при котором будем считать совершеннолетним
def get_age_group(age, threshold):
    if age >= int(threshold):
        age_group = 'adult'
    else:
        age_group = 'minor'

    return age_group

In [66]:
# применим эту функцию 
people['age_group'] = people['age'].apply(get_age_group, threshold = 21)

people

      name  gender  age  height  weight age_group
0  Алексей    male   35  180.46   73.61     adult
1     Иван    male   20  182.26   75.34     minor
2     Анна  female   13  165.12   50.22     minor
3    Ольга     NaN   28  168.04   52.14     adult
4  Николай    male   16  178.68   69.72     minor

В метод .apply() можно передать уже имеющуюся в Питоне функцию, например, из библиотеки Numpy.

In [67]:
# заменим значение в столбцах height и weight на медиану по столбцам
people[['height', 'weight']] = people[['height', 'weight']].apply(np.median, axis = 0)
people

C:\Users\GIGABYTE\AppData\Local\Temp\ipykernel_3944\282977442.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  people[['height', 'weight']] = people[['height', 'weight']].apply(np.median, axis = 0)

      name  gender  age  height  weight age_group
0  Алексей    male   35  178.68   69.72     adult
1     Иван    male   20  178.68   69.72     minor
2     Анна  female   13  178.68   69.72     minor
3    Ольга     NaN   28  178.68   69.72     adult
4  Николай    male   16  178.68   69.72     minor

__Применение к строкам__

In [68]:
# создадим функцию индекса массы тела
def get_bmi(x):
    bmi = x['weight'] / (x['height'] / 100) ** 2
    return bmi

In [69]:
# для применения функции к строке используется параметр axis = 1
people['bmi'] = people.apply(get_bmi, axis = 1).round(2)
people

      name  gender  age  height  weight age_group    bmi
0  Алексей    male   35  178.68   69.72     adult  21.84
1     Иван    male   20  178.68   69.72     minor  21.84
2     Анна  female   13  178.68   69.72     minor  21.84
3    Ольга     NaN   28  178.68   69.72     adult  21.84
4  Николай    male   16  178.68   69.72     minor  21.84

__Метод .applymap()__

Метод .applymap() позволяет применять функции с именованными аргументами ко всему датафрейму (метод .apply() применяется только к строкам или столбцам). Рассмотрим несложный пример.

In [70]:
nums_matrix = [[13, 7, 1],
               [4, 2, 25],
               [45, 3, 8]]

nums = pd.DataFrame(nums_matrix)
nums

    0  1   2
0  13  7   1
1   4  2  25
2  45  3   8

In [71]:
# объявим функцию, которая на входе принимает число х и прибавляет число
def add_number(x, number):
    return x + number

In [72]:
# передадим методу .applymap() функцию
nums.applymap(add_number, number = 1)

C:\Users\GIGABYTE\AppData\Local\Temp\ipykernel_3944\145898310.py:2: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  nums.applymap(add_number, number = 1)

    0  1   2
0  14  8   2
1   5  3  26
2  46  4   9

__Метод .pipe()__

Метод .pipe(), как следует из его названия, позволяет создать pipeline и последовательно применить несколько функций к датафрейму. Вновь создадим исходный датафрейм с параметрами нескольких людей.

In [73]:
people = pd.DataFrame({'name'        : ['Алексей', 'Иван', 'Анна', 'Ольга', 'Николай'],
                       'gender'      : [1, 1, 0, 2, 1],
                       'age'         : [35, 20, 13, 28, 16],
                       'height'      : [180.46, 182.26, 165.12, 168.04, 178.68],
                       'weight'      : [73.61, 75.34, 50.22, 52.14, 69.72]
                       })

people

      name  gender  age  height  weight
0  Алексей       1   35  180.46   73.61
1     Иван       1   20  182.26   75.34
2     Анна       0   13  165.12   50.22
3    Ольга       2   28  168.04   52.14
4  Николай       1   16  178.68   69.72

In [74]:
# объявим несколько функций, которые применим ко всему датафрейму
# скопируем DataFrame
def copy_df(df):
    return df.copy()

# заменим значения столбца на новые с помощью метода .map()
def map_columns(df, column, label1, label2):
    labels_map = {0: label1, 1: label2}
    df[column] = df[column].map(labels_map)
    return df
    
# создадим функцию для превращения количественной переменной в категориальную
def to_categorical(df, newcol, condcol, thres, cat1, cat2):
    df[newcol] = np.where(df[condcol] >= thres, cat1, cat2)
    return df

In [75]:
# последовательно применим эти функции с помощью нескольких методов .pipe()
people_processed = (people.
                    pipe(copy_df).
                    pipe(map_columns, 'gender', 'femail', 'mail').
                    pipe(to_categorical, 'age_group', 'age', 18, 'adult', 'minor'))

people_processed

      name  gender  age  height  weight age_group
0  Алексей    mail   35  180.46   73.61     adult
1     Иван    mail   20  182.26   75.34     adult
2     Анна  femail   13  165.12   50.22     minor
3    Ольга     NaN   28  168.04   52.14     adult
4  Николай    mail   16  178.68   69.72     minor

### __Соединение DataFrame__

__pd.concat()__ в функцию pd.concat() нельзя передать словарь, только объекты Series и DataFrame.

In [76]:
 s1 = pd.DataFrame({
     'item': ['карандаш', 'ручка', 'папка', 'степлер'],
     'price': [220, 340, 200, 500]
 })

s2 = pd.DataFrame({
    'item': ['клей', 'корректор', 'скрепка', 'бумага'],
    'price': [200, 240, 100, 300]
})

In [77]:
s1

       item  price
0  карандаш    220
1     ручка    340
2     папка    200
3   степлер    500

In [78]:
s2

        item  price
0       клей    200
1  корректор    240
2    скрепка    100
3     бумага    300

__pd.concat()__

In [79]:
# передадим в функцию pd.concat()
pd.concat([s1, s2], axis = 0)

        item  price
0   карандаш    220
1      ручка    340
2      папка    200
3    степлер    500
0       клей    200
1  корректор    240
2    скрепка    100
3     бумага    300

In [80]:
# обновим индекс через параметр ignore_index = True
pd.concat([s1, s2], axis = 0, ignore_index = True)

        item  price
0   карандаш    220
1      ручка    340
2      папка    200
3    степлер    500
4       клей    200
5  корректор    240
6    скрепка    100
7     бумага    300

In [81]:
# создадим многоуровневый (иерархический) индекс
# передадим в параметр keys названия групп индекса, параметр names получит названия уровней индекса
by_shop = pd.concat([s1, s2], axis = 0, keys = ['s1', 's2'], names = ['s', 'id'])
by_shop

            item  price
s  id
s1 0    карандаш    220
   1       ручка    340
   2       папка    200
   3     степлер    500
s2 0        клей    200
   1   корректор    240
   2     скрепка    100
   3      бумага    300

In [82]:
# посмотрим на созданный индекс
by_shop.index

MultiIndex([('s1', 0),
            ('s1', 1),
            ('s1', 2),
            ('s1', 3),
            ('s2', 0),
            ('s2', 1),
            ('s2', 2),
            ('s2', 3)],
           names=['s', 'id'])

In [83]:
# выведем первую запись в группе
by_shop.loc[('s1', 0)]

item     карандаш
price         220
Name: (s1, 0), dtype: object

In [84]:
pd.concat([s1, s2], axis = 1, keys = ['s1', 's2'])

         s1               s2
       item price       item price
0  карандаш   220       клей   200
1     ручка   340  корректор   240
2     папка   200    скрепка   100
3   степлер   500     бумага   300

In [85]:
# выберем вторую группу с помощью .iloc[]
pd.concat([s1, s2], axis = 1, keys = ['s1', 's2']).loc[:, 's2']

        item  price
0       клей    200
1  корректор    240
2    скрепка    100
3     бумага    300

In [86]:
# для транспонирования используем метод .T or .transpose()
pd.concat([s1, s2], axis = 1, keys = ['s1', 's2']).T

                 0          1        2        3
s1 item   карандаш      ручка    папка  степлер
   price       220        340      200      500
s2 item       клей  корректор  скрепка   бумага
   price       200        240      100      300

__pd.merge() and .join()__

In [87]:
math_dict = {
    'name': ['Андрей', 'Елена', 'Антон', 'Татьяна'],
    'math_score': [83, 84, 78, 80]
}

math_degree_dict = {
    'degree': ['B', 'M', 'B', 'M']
}

cs_dict = {
    'name': ['Андрей', 'Ольга', 'Евгений', 'Татьяна'],
    'cs_score': [87, 82, 77, 81]
}

math = pd.DataFrame(math_dict)
cs = pd.DataFrame(cs_dict)
math_degree = pd.DataFrame(math_degree_dict)

In [88]:
math

      name  math_score
0   Андрей          83
1    Елена          84
2    Антон          78
3  Татьяна          80

In [89]:
cs

      name  cs_score
0   Андрей        87
1    Ольга        82
2  Евгений        77
3  Татьяна        81

In [90]:
math_degree

  degree
0      B
1      M
2      B
3      M

__Left join__

In [91]:
# объединим два датафрейма в помощью merge
pd.merge(math, math_degree, # выполним слияние двух датафреймов
         how = 'left', # способом left join
         left_index = True, right_index = True) # по индексам левого и правого датафреймов

      name  math_score degree
0   Андрей          83      B
1    Елена          84      M
2    Антон          78      B
3  Татьяна          80      M

In [92]:
# объединим два датафрейма в помощью join
math.join(math_degree)

      name  math_score degree
0   Андрей          83      B
1    Елена          84      M
2    Антон          78      B
3  Татьяна          80      M

Здесь важно отметить, что главным является датафрейм слева. Другими словами, если в столбцах, по которым мы соединяем датафреймы есть расхождения, библиотека Pandas сохранит нетронутым левый датафрейм, а в правом — либо заполнит недостающие значения пропусками, либо удалит лишние строки.

In [93]:
# выполним left join по столбцу name
pd.merge(math, cs, how = 'left', on = 'name')

      name  math_score  cs_score
0   Андрей          83      87.0
1    Елена          84       NaN
2    Антон          78       NaN
3  Татьяна          80      81.0

__Left exluding join__

In [94]:
pd.merge(math, cs, how = 'left', on = 'name', indicator = True)

      name  math_score  cs_score     _merge
0   Андрей          83      87.0       both
1    Елена          84       NaN  left_only
2    Антон          78       NaN  left_only
3  Татьяна          80      81.0       both

In [95]:
# теперь с помощью метода .query() выберем только записи из левого датафрейма и удалим столбец _merge
pd.merge(math, cs, how = 'left', on = 'name', indicator = True) \
    .query('_merge == "left_only"').drop(columns = '_merge')

    name  math_score  cs_score
1  Елена          84       NaN
2  Антон          78       NaN

__Right join__

In [96]:
pd.merge(math, cs, how = 'right', on = 'name')

      name  math_score  cs_score
0   Андрей        83.0        87
1    Ольга         NaN        82
2  Евгений         NaN        77
3  Татьяна        80.0        81

__Right excluding join__

In [97]:
pd.merge(math, cs, how = 'right', on = 'name', indicator = True)

      name  math_score  cs_score      _merge
0   Андрей        83.0        87        both
1    Ольга         NaN        82  right_only
2  Евгений         NaN        77  right_only
3  Татьяна        80.0        81        both

In [104]:
# воспользуемся метод query()
pd.merge(math, cs, how = 'right', on = 'name', indicator = True) \
    .query('_merge == "right_only"').drop(columns = '_merge')

      name  math_score  cs_score
1    Ольга         NaN        82
2  Евгений         NaN        77

__Outer join__

In [105]:
pd.merge(math, cs, how = 'outer', on = 'name')

      name  math_score  cs_score
0   Андрей        83.0      87.0
1    Елена        84.0       NaN
2    Антон        78.0       NaN
3  Татьяна        80.0      81.0
4    Ольга         NaN      82.0
5  Евгений         NaN      77.0

__Full excluding join__

In [106]:
pd.merge(math, cs, how = 'outer', on = 'name', indicator = True)

      name  math_score  cs_score      _merge
0   Андрей        83.0      87.0        both
1    Елена        84.0       NaN   left_only
2    Антон        78.0       NaN   left_only
3  Татьяна        80.0      81.0        both
4    Ольга         NaN      82.0  right_only
5  Евгений         NaN      77.0  right_only

In [107]:
# оставим только те данные которых нет в обеих датафреймах
pd.merge(math, cs, how = 'outer', indicator = True) \
    .query('_merge != "both"') \
    .drop(columns = '_merge')

      name  math_score  cs_score
1    Елена        84.0       NaN
2    Антон        78.0       NaN
4    Ольга         NaN      82.0
5  Евгений         NaN      77.0

__Inner join__ Внутреннее соединение (inner join) сохраняет только те наблюдения, которые есть в обоих датафреймах.

In [108]:
pd.merge(math, cs, how = 'inner', on = 'name')

      name  math_score  cs_score
0   Андрей          83        87
1  Татьяна          80        81

In [109]:
# по умолчанию merge выполняет inner join
pd.merge(math, cs)

      name  math_score  cs_score
0   Андрей          83        87
1  Татьяна          80        81

Здесь нужно быть аккуратным, потому что если левый датафрейм был главным (его записи должны быть сохранены в обязательном порядке), использование pd.merge() с параметром по умолчанию (how = ‘inner’) вызовет потерю данных (лучше использовать left join).

__Соединение DataFrame и дубликаты__

In [110]:
product_data = pd.DataFrame([[1, 'холодильник'], [2, 'телевизор']], columns = ['code', 'product'])
price_data = pd.DataFrame([[1, 40000], [1, 60000]], columns = ['code', 'price'])

In [111]:
product_data

   code      product
0     1  холодильник
1     2    телевизор

In [112]:
price_data

   code  price
0     1  40000
1     1  60000

In [114]:
pd.merge(product_data, price_data, how = 'left', on = 'code')

   code      product    price
0     1  холодильник  40000.0
1     1  холодильник  60000.0
2     2    телевизор      NaN